Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20J18AU.atdf
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="2.1.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOSC_CLK" function="XOSC_TEST" pad="PA09"/>
              <signal group="XOSC_EN" function="XOSC_TEST" pad="PA08"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_FDPLL" value="0"/>
              <param name="GCLK_ID_FDPLL32K" value="1"/>
              <param name="FDPLL_VERSION" value="0x211"/>
              <param name="OSC48M_VERSION" value="0x101"/>
              <param name="XOSC_VERSION" value="0x201"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="2.1.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="3"/>
              <param name="INTFLAG_NUM" value="4"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="2.1.0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1"/>
              <param name="PD_NUM" value="0"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="2.1.1">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41000000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
            </signals>
            <parameters>
              <param name="BITS" value="64"/>
              <param name="DRVSTR" value="1"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="2"/>
              <param name="ODRAIN" value="0"/>
              <param name="SLEWLIM" value="0"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="3.1.0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42005800"/>
            <signals>
              <signal group="X" index="0" function="B_PTCX" pad="PA08"/>
              <signal group="X" index="1" function="B_PTCX" pad="PA09"/>
              <signal group="X" index="2" function="B_PTCX" pad="PA10"/>
              <signal group="X" index="3" function="B_PTCX" pad="PA11"/>
              <signal group="X" index="4" function="B_PTCX" pad="PA16"/>
              <signal group="X" index="5" function="B_PTCX" pad="PA17"/>
              <signal group="X" index="6" function="B_PTCX" pad="PA18"/>
              <signal group="X" index="7" function="B_PTCX" pad="PA19"/>
              <signal group="X" index="8" function="B_PTCX" pad="PA20"/>
              <signal group="X" index="9" function="B_PTCX" pad="PA21"/>
              <signal group="X" index="10" function="B_PTCX" pad="PA22"/>
              <signal group="X" index="11" function="B_PTCX" pad="PA23"/>
              <signal group="X" index="12" function="B_PTCX" pad="PB12"/>
              <signal group="X" index="13" function="B_PTCX" pad="PB13"/>
              <signal group="X" index="14" function="B_PTCX" pad="PB14"/>
              <signal group="X" index="15" function="B_PTCX" pad="PB15"/>
              <signal group="Y" index="0" function="B_PTCY" pad="PA02"/>
              <signal group="Y" index="1" function="B_PTCY" pad="PA03"/>
              <signal group="Y" index="2" function="B_PTCY" pad="PA04"/>
              <signal group="Y" index="3" function="B_PTCY" pad="PA05"/>
              <signal group="Y" index="4" function="B_PTCY" pad="PA06"/>
              <signal group="Y" index="5" function="B_PTCY" pad="PA07"/>
              <signal group="Y" index="6" function="B_PTCY" pad="PB00"/>
              <signal group="Y" index="7" function="B_PTCY" pad="PB01"/>
              <signal group="Y" index="8" function="B_PTCY" pad="PB02"/>
              <signal group="Y" index="9" function="B_PTCY" pad="PB03"/>
              <signal group="Y" index="14" function="B_PTCY" pad="PB08"/>
              <signal group="Y" index="15" function="B_PTCY" pad="PB09"/>
              <signal group="Y" index="16" function="B_PTCY" pad="PA08"/>
              <signal group="Y" index="17" function="B_PTCY" pad="PA09"/>
              <signal group="Y" index="18" function="B_PTCY" pad="PA10"/>
              <signal group="Y" index="19" function="B_PTCY" pad="PA11"/>
              <signal group="Y" index="20" function="B_PTCY" pad="PA16"/>
              <signal group="Y" index="21" function="B_PTCY" pad="PA17"/>
              <signal group="Y" index="22" function="B_PTCY" pad="PA18"/>
              <signal group="Y" index="23" function="B_PTCY" pad="PA19"/>
              <signal group="Y" index="24" function="B_PTCY" pad="PA20"/>
              <signal group="Y" index="25" function="B_PTCY" pad="PA21"/>
              <signal group="Y" index="26" function="B_PTCY" pad="PA22"/>
              <signal group="Y" index="27" function="B_PTCY" pad="PA23"/>
              <signal group="Y" index="28" function="B_PTCY" pad="PB12"/>
              <signal group="Y" index="29" function="B_PTCY" pad="PB13"/>
              <signal group="Y" index="30" function="B_PTCY" pad="PB14"/>
              <signal group="Y" index="31" function="B_PTCY" pad="PB15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="46"/>
              <param name="DMAC_ID_SEQ" value="48"/>
              <param name="DMAC_ID_WCOMP" value="47"/>
              <param name="GCLK_ID" value="37"/>
              <param name="X_LINES_NUM" value="16"/>
              <param name="Y_LINES_NUM" value="32"/>
              <param name="INSTANCE_ID" value="86"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="2.0.2">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="EXTWAKE" index="0" function="A_EXTWAKE" pad="PA00"/>
              <signal group="EXTWAKE" index="1" function="A_EXTWAKE" pad="PA01"/>
              <signal group="EXTWAKE" index="2" function="A_EXTWAKE" pad="PA02"/>
              <signal group="EXTWAKE" index="3" function="A_EXTWAKE" pad="PA03"/>
              <signal group="EXTWAKE" index="4" function="A_EXTWAKE" pad="PA04"/>
              <signal group="EXTWAKE" index="5" function="A_EXTWAKE" pad="PA05"/>
              <signal group="EXTWAKE" index="6" function="A_EXTWAKE" pad="PA06"/>
              <signal group="EXTWAKE" index="7" function="A_EXTWAKE" pad="PA07"/>
              <signal group="EXTWAKE" index="8" function="A_EXTWAKE" pad="PA08"/>
              <signal group="EXTWAKE" index="9" function="A_EXTWAKE" pad="PA09"/>
              <signal group="EXTWAKE" index="10" function="A_EXTWAKE" pad="PA10"/>
              <signal group="EXTWAKE" index="11" function="A_EXTWAKE" pad="PA11"/>
              <signal group="EXTWAKE" index="12" function="A_EXTWAKE" pad="PA12"/>
              <signal group="EXTWAKE" index="13" function="A_EXTWAKE" pad="PA13"/>
              <signal group="EXTWAKE" index="14" function="A_EXTWAKE" pad="PA14"/>
              <signal group="EXTWAKE" index="15" function="A_EXTWAKE" pad="PA15"/>
            </signals>
            <parameters>
              <param name="NUMBER_OF_EXTWAKE" value="0"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="1.1.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GPR_NUM" value="0"/>
              <param name="PER_NUM" value="8"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="3.1.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="2"/>
              <param name="DMAC_ID_TX" value="3"/>
              <param name="GCLK_ID_CORE" value="19"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="GCLK_ID_CORE" value="20"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
