Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20J18AU.atdf
      <value-group name="AC_COMPCTRL__FLEN">
        <value name="OFF" caption="No filtering" value="0"/>
        <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1"/>
        <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2"/>
      </value-group>
      <value-group name="AC_COMPCTRL__HYST">
        <value name="HYST50" caption="50mV" value="0"/>
        <value name="HYST70" caption="70mV" value="1"/>
        <value name="HYST90" caption="90mV" value="2"/>
        <value name="HYST110" caption="110mV" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator output toggle" value="0"/>
        <value name="RISING" caption="Interrupt on comparator output rising" value="1"/>
        <value name="FALLING" caption="Interrupt on comparator output falling" value="2"/>
        <value name="EOC" caption="Interrupt on end of comparison (single-shot mode only)" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXNEG">
        <value name="PIN0" caption="I/O pin 0" value="0"/>
        <value name="PIN1" caption="I/O pin 1" value="1"/>
        <value name="PIN2" caption="I/O pin 2" value="2"/>
        <value name="PIN3" caption="I/O pin 3" value="3"/>
        <value name="GND" caption="Ground" value="4"/>
        <value name="VSCALE" caption="VDD scaler" value="5"/>
        <value name="BANDGAP" caption="Internal bandgap voltage" value="6"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXPOS">
        <value name="PIN0" caption="I/O pin 0" value="0"/>
        <value name="PIN1" caption="I/O pin 1" value="1"/>
        <value name="PIN2" caption="I/O pin 2" value="2"/>
        <value name="PIN3" caption="I/O pin 3" value="3"/>
        <value name="VSCALE" caption="VDD Scaler" value="4"/>
      </value-group>
      <value-group name="AC_COMPCTRL__OUT">
        <value name="OFF" caption="The output of COMPn is not routed to the COMPn I/O port" value="0"/>
        <value name="ASYNC" caption="The asynchronous output of COMPn is routed to the COMPn I/O port" value="1"/>
        <value name="SYNC" caption="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" value="2"/>
      </value-group>
      <value-group name="AC_COMPCTRL__SPEED">
        <value name="LOW" caption="Low speed" value="0"/>
        <value name="HIGH" caption="High speed" value="3"/>
      </value-group>
    </module>
    <module name="ADC" id="U2247" version="2.2.0" caption="Analog Digital Converter">
      <register-group name="ADC" caption="Analog Digital Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="SLAVEEN" caption="Slave Enable" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="PRESCALER" caption="Prescaler Configuration" mask="0x7" values="ADC_CTRLB__PRESCALER"/>
        </register>
        <register name="REFCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Reference Control">
          <bitfield name="REFSEL" caption="Reference Selection" mask="0xF" values="ADC_REFCTRL__REFSEL"/>
          <bitfield name="REFCOMP" caption="Reference Buffer Offset Compensation Enable" mask="0x80"/>
        </register>
        <register name="EVCTRL" offset="0x3" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="FLUSHEI" caption="Flush Event Input Enable" mask="0x1"/>
          <bitfield name="STARTEI" caption="Start Conversion Event Input Enable" mask="0x2"/>
          <bitfield name="FLUSHINV" caption="Flush Event Invert Enable" mask="0x4"/>
          <bitfield name="STARTINV" caption="Satrt Event Invert Enable" mask="0x8"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
          <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Disable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Disable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Flag" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Flag" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Flag" mask="0x4"/>
        </register>
        <register name="SEQSTATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Sequence Status">
          <bitfield name="SEQSTATE" caption="Sequence State" mask="0x1F"/>
          <bitfield name="SEQBUSY" caption="Sequence Busy" mask="0x80"/>
        </register>
        <register name="INPUTCTRL" offset="0x8" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Input Control">
          <bitfield name="MUXPOS" caption="Positive Mux Input Selection" mask="0x1F" values="ADC_INPUTCTRL__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Mux Input Selection" mask="0x1F00" values="ADC_INPUTCTRL__MUXNEG"/>
        </register>
        <register name="CTRLC" offset="0xA" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Control C">
          <bitfield name="DIFFMODE" caption="Differential Mode" mask="0x1"/>
          <bitfield name="LEFTADJ" caption="Left-Adjusted Result" mask="0x2"/>
          <bitfield name="FREERUN" caption="Free Running Mode" mask="0x4"/>
          <bitfield name="CORREN" caption="Digital Correction Logic Enable" mask="0x8"/>
          <bitfield name="RESSEL" caption="Conversion Result Resolution" mask="0x30" values="ADC_CTRLC__RESSEL"/>
          <bitfield name="R2R" caption="Rail-to-Rail mode enable" mask="0x80"/>
          <bitfield name="WINMODE" caption="Window Monitor Mode" mask="0x700" values="ADC_CTRLC__WINMODE"/>
          <bitfield name="DUALSEL" caption="Dual Mode Trigger Selection" mask="0x3000" values="ADC_CTRLC__DUALSEL"/>
        </register>
        <register name="AVGCTRL" offset="0xC" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Average Control">
          <bitfield name="SAMPLENUM" caption="Number of Samples to be Collected" mask="0xF" values="ADC_AVGCTRL__SAMPLENUM"/>
          <bitfield name="ADJRES" caption="Adjusting Result / Division Coefficient" mask="0x70"/>
        </register>
        <register name="SAMPCTRL" offset="0xD" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Sample Time Control">
          <bitfield name="SAMPLEN" caption="Sampling Time Length" mask="0x3F"/>
          <bitfield name="OFFCOMP" caption="Comparator Offset Compensation Enable" mask="0x80"/>
        </register>
        <register name="WINLT" offset="0xE" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Window Monitor Lower Threshold">
          <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFF"/>
        </register>
        <register name="WINUT" offset="0x10" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Window Monitor Upper Threshold">
          <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFF"/>
        </register>
        <register name="GAINCORR" offset="0x12" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Gain Correction">
          <bitfield name="GAINCORR" caption="Gain Correction Value" mask="0xFFF"/>
        </register>
        <register name="OFFSETCORR" offset="0x14" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Offset Correction">
          <bitfield name="OFFSETCORR" caption="Offset Correction Value" mask="0xFFF"/>
        </register>
        <register name="SWTRIG" offset="0x18" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Software Trigger">
          <bitfield name="FLUSH" caption="ADC Flush" mask="0x1"/>
          <bitfield name="START" caption="Start ADC Conversion" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x1C" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x20" rw="R" size="2" initval="0x0000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="SWRST Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
          <bitfield name="INPUTCTRL" caption="INPUTCTRL Synchronization Busy" mask="0x4"/>
          <bitfield name="CTRLC" caption="CTRLC Synchronization Busy" mask="0x8"/>
          <bitfield name="AVGCTRL" caption="AVGCTRL Synchronization Busy" mask="0x10"/>
          <bitfield name="SAMPCTRL" caption="SAMPCTRL Synchronization Busy" mask="0x20"/>
          <bitfield name="WINLT" caption="WINLT Synchronization Busy" mask="0x40"/>
          <bitfield name="WINUT" caption="WINUT Synchronization Busy" mask="0x80"/>
          <bitfield name="GAINCORR" caption="GAINCORR Synchronization Busy" mask="0x100"/>
          <bitfield name="OFFSETCORR" caption="OFFSETCTRL Synchronization Busy" mask="0x200"/>
          <bitfield name="SWTRIG" caption="SWTRG Synchronization Busy" mask="0x400"/>
        </register>
        <register name="RESULT" offset="0x24" rw="R" size="2" initval="0x0000" caption="Result">
          <bitfield name="RESULT" caption="Result Value" mask="0xFFFF"/>
        </register>
